package com.itmo.jjd.Lesson2.HW;

// Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….

public class Task3 {
    public static void main(String[] args) {
        int a = 0;
                for(int i = 18; i >=0; i--)
        System.out.print(a+5*i+" ");
    }
}
